In [49]:
import pandas as pd
from supabase import create_client
from pymongo import MongoClient

# conexión a la base de datos operacional
url_operacional = 'https://ggvtnhsokxrroymxgres.supabase.co'
key_operacional = 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZSIsInJlZiI6ImdndnRuaHNva3hycm95bXhncmVzIiwicm9sZSI6InNlcnZpY2Vfcm9sZSIsImlhdCI6MTc0ODYzNTgwNCwiZXhwIjoyMDY0MjExODA0fQ.iRMSBrcUSlA-IpiofR6xc4W6_Dq-smhhMs6sBKHk_dA'
supabase_op = create_client(url_operacional, key_operacional)

# conexión a la base de datos de MongoDB
uri = 'mongodb+srv://naza:chauflix123@chauflix.g5rhogq.mongodb.net/'
client = MongoClient(uri)
mongo = client['chauflix']

# conexión al datawarehouse
url_dw = 'https://hcwyzlprqjlwqwdrfrco.supabase.co'
key_dw = 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZSIsInJlZiI6Imhjd3l6bHBycWpsd3F3ZHJmcmNvIiwicm9sZSI6InNlcnZpY2Vfcm9sZSIsImlhdCI6MTc0OTA3NjkzOSwiZXhwIjoyMDY0NjUyOTM5fQ.kslrFLfk4e6HRIPs60qjwna4XWiXIPiJSv7988QjLIo'
supabase_dw = create_client(url_dw, key_dw)

In [50]:
ratings = mongo['ratings']

ratings_df = pd.DataFrame(list(ratings.find()))

In [51]:
ratings_df.head()

                        _id  user_id  movie_id  rating            timestamp
0  6840dc424822cb9ccf216b22        1         1     4.0  2024-11-23 16:56:59
1  6840dc424822cb9ccf216b23        1         3     4.0  2022-05-05 16:56:59
2  6840dc424822cb9ccf216b24        1         6     4.0  2024-03-11 16:56:59
3  6840dc424822cb9ccf216b25        1        44     5.0  2023-04-28 16:56:59
4  6840dc424822cb9ccf216b26        1        47     5.0  2023-12-08 16:56:59

In [52]:
ratings_df['rating'] = ratings_df['rating']*2
ratings_df.head()

                        _id  user_id  movie_id  rating            timestamp
0  6840dc424822cb9ccf216b22        1         1     8.0  2024-11-23 16:56:59
1  6840dc424822cb9ccf216b23        1         3     8.0  2022-05-05 16:56:59
2  6840dc424822cb9ccf216b24        1         6     8.0  2024-03-11 16:56:59
3  6840dc424822cb9ccf216b25        1        44    10.0  2023-04-28 16:56:59
4  6840dc424822cb9ccf216b26        1        47    10.0  2023-12-08 16:56:59

In [53]:
ratings_df['timestamp'] = pd.to_datetime(ratings_df['timestamp'])

In [54]:
ratings_df['timestamp'] = ratings_df['timestamp'].dt.date
ratings_df.head()

                        _id  user_id  movie_id  rating   timestamp
0  6840dc424822cb9ccf216b22        1         1     8.0  2024-11-23
1  6840dc424822cb9ccf216b23        1         3     8.0  2022-05-05
2  6840dc424822cb9ccf216b24        1         6     8.0  2024-03-11
3  6840dc424822cb9ccf216b25        1        44    10.0  2023-04-28
4  6840dc424822cb9ccf216b26        1        47    10.0  2023-12-08

In [55]:
ratings_df.rename(columns={'_id': 'id', 'timestamp': 'date'}, inplace=True)
ratings_df.head()

                         id  user_id  movie_id  rating        date
0  6840dc424822cb9ccf216b22        1         1     8.0  2024-11-23
1  6840dc424822cb9ccf216b23        1         3     8.0  2022-05-05
2  6840dc424822cb9ccf216b24        1         6     8.0  2024-03-11
3  6840dc424822cb9ccf216b25        1        44    10.0  2023-04-28
4  6840dc424822cb9ccf216b26        1        47    10.0  2023-12-08

In [56]:
ratings_df['date'] = ratings_df['date'].astype(str)
ratings_df['rating'] = ratings_df['rating'].astype(int)
ratings_df['id'] = ratings_df['id'].astype(str)

In [57]:
ratings_df.head()

                         id  user_id  movie_id  rating        date
0  6840dc424822cb9ccf216b22        1         1       8  2024-11-23
1  6840dc424822cb9ccf216b23        1         3       8  2022-05-05
2  6840dc424822cb9ccf216b24        1         6       8  2024-03-11
3  6840dc424822cb9ccf216b25        1        44      10  2023-04-28
4  6840dc424822cb9ccf216b26        1        47      10  2023-12-08

In [58]:
def objectid_to_int(oid):
    import hashlib
    return int(hashlib.sha1(oid.encode()).hexdigest()[:8], 16)

In [59]:
ratings_df['id'] = ratings_df['id'].apply(objectid_to_int)

In [60]:
insert = supabase_dw.table('fact_rating').insert(ratings_df.to_dict(orient='records')).execute()